In [6]:
pip install psycopg2-binary

Collecting psycopg2-binary
  Downloading psycopg2_binary-2.9.9-cp39-cp39-win_amd64.whl (1.2 MB)
Installing collected packages: psycopg2-binary
Successfully installed psycopg2-binary-2.9.9
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd
import sqlalchemy

engine = sqlalchemy.create_engine('postgresql://postgres:123456@localhost:5432/mydb')

### Read From Database

In [3]:
#read SQL table into a dataframe
df = pd.read_sql_table("customers", engine)
df

   id    name phone_number
0   1  Donald   7263548932
1   2    Bill   5263745213
2   3    Modi   3425167483

In [4]:
#If want to read only specific columns
df = pd.read_sql_table("customers", engine, columns=['name', 'phone_number'])
df

     name phone_number
0  Donald   7263548932
1    Bill   5263745213
2    Modi   3425167483

In [5]:
#Read two tables after joinning them
query = '''
    SELECT customers.name, customers.phone_number, orders.name, orders.amount
    FROM customers INNER JOIN orders 
    ON customers.id = orders.customer_id
'''

df = pd.read_sql_query(query, engine)
df

     name phone_number          name  amount
0    Bill   5263745213          Yoga      20
1  Donald   7263548932  Google Pixel     950
2    Modi   3425167483  Fossil Watch     120

### Write To Database

In [21]:
df = pd.read_csv('customers.csv')
df

   id    Customer Name  Customer Phone
0   4     rafael nadal      4567895647
1   5  maria sharapova       434534545
2   6   vladimir putin        89345345
3   7      kim un jong       123434456
4   8       jeff bezos       934534543
5   9     rahul gandhi        44324222

In [22]:
#Rename column names of dataframe
df.rename( columns = {
    'Customer Name': 'name',
    'Customer Phone': 'phone_number'
}, inplace = True)
df

   id             name  phone_number
0   4     rafael nadal    4567895647
1   5  maria sharapova     434534545
2   6   vladimir putin      89345345
3   7      kim un jong     123434456
4   8       jeff bezos     934534543
5   9     rahul gandhi      44324222

In [23]:
#Write csv file to sql table using 'to_sql()'' method

df.to_sql(
    name = 'customers',
    con = engine,
    index = False,
    if_exists = 'append'
)

6

In [24]:
#We can read table data in a DataBase using read_sql() method
#If we provide table name, it act as read_sql_table() method
df = pd.read_sql('customers', engine)
df

   id             name phone_number
0   1           Donald   7263548932
1   2             Bill   5263745213
2   3             Modi   3425167483
3   4     rafael nadal   4567895647
4   5  maria sharapova    434534545
5   6   vladimir putin     89345345
6   7      kim un jong    123434456
7   8       jeff bezos    934534543
8   9     rahul gandhi     44324222

In [25]:
#If we provide query, it act as read_sql_query() method
df = pd.read_sql(query, engine)
df

     name phone_number          name  amount
0    Bill   5263745213          Yoga      20
1  Donald   7263548932  Google Pixel     950
2    Modi   3425167483  Fossil Watch     120